#!/bin/bash

_folder_path_icon() {
    local P="$1"

    if [ -x "$(command -v md5)" ]; then
        P=$(md5 -s "$P")
    fi

    if [ -x "$(command -v md5sum)" ]; then
        P=$(md5sum -s "$P")
    fi

    local HASH_NUM="$(echo "$P" | sed -E 's/[^0-9]//g')"
    local ICON_INDEX=${HASH_NUM:(${#HASH_NUM} - 2)}
    local ICONS=(
        "📁" "🗄️" "🏆" "💤" "🌀" "♠️" "♥️" "♦️" "♣️" "🃏"
        "🖥️" "💻" "💽" "🖱️" "🖲️" "⌨️" "🖨️" "💾" "📀" "💿"
        "🧅" "🕹️" "👨‍💻" "🐁" "🗜️" "🤖" "🔆" "⚜️" "🔱" "💠"
        "🐻" "🙈" "🙉" "🙊" "🐕" "🐺" "🐈‍⬛" "🦁" "🐯" "🐴"
        "🐇" "🐥" "🦆" "🦢" "🦉" "🦖" "🐉" "🐲" "🕷️" "🕸️"
        "🌍" "🌑" "🌓" "🌖" "🌙" "☀️" "☁️" "🌪️" "❄️" "☄️"
        "🔥" "⛄" "🌊" "💧" "❤️‍🔥" "❤️" "🍔" "🍏" "🍎" "🍒"
        "🍐" "🥕" "🌶️" "🫑" "🍄" "🍕" "🥚" "🍿" "🥡" "☕"
        "🧉" "🧊" "🫐" "🥦" "🍗" "🍇" "🍓" "🥥" "😜" "😎"
        "🍶" "🍾" "🍷" "🍸" "🍹" "🍺" "🍻" "🥂" "🥃" "🥤"
    )

    echo ${ICONS[$ICON_INDEX]}
}

_folder_path_icon $(pwd)
_folder_path_icon ''
_folder_path_icon '/'
_folder_path_icon '/1'
_folder_path_icon '/pwd/1'
_folder_path_icon '/pwd'
